# tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "wez/wezterm"

# brew
brew "cask"
brew "mas"

brew "ghq"
brew "git"
brew "neovim", args: ["HEAD"]
brew "rtx"
brew "zoxide"
brew "peco"
brew "bat"
brew "docker"
brew "fish"
brew "fzf"

# cask
cask "visual-studio-code"
cask "wezterm"
cask "xcodes"
cask "jetbrains-toolbox"
cask "google-chrome"
cask "slack"
cask "raycast"
cask "docker"
cask "notion"
cask "obsidian"

# vscode(Extensionをインストールする)
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "Dart-Code.flutter"
vscode "Dart-Code.dart-code"
vscode "vscodevim.vim"
